Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеПроверятьСеансы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноСеансов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСканерШК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БитДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скорость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтопСимвол</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщатьСобытияШК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлавиатурныйСканерШК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВидетьЧужиеНакладные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВидетьЧужиеПродажиВОтчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Складов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладовОтправителя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладыИсключать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДенежныхСчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДенежныеСчетаИсключать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TelegramID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательИБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходВПрограммуРазрешен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотребоватьСменуПароляПриВходе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольУстановлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДоступаККонтрагентам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступКОстаткамТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГраницаПросмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоВхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьОкончательноВПриходныхНакладных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширенныеФункцииРазработчика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тэг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
					<Comment>Доступные (или недоступные) склады</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОграниченияПоСкладам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ограничение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ОграниченияПоСкладам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДенежныеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДенежныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СкладыКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Офисы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Офис</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ глПриСозданииНаСервереЭлемент(ЭтаФорма, Объект) Тогда Отказ = Истина; Возврат; КонецЕсли;  
	
	// © Primus1C  26.08.2023  НАЧАЛО ►
	
	ОписаниеПользователяИБ = ОписаниеПользователяИБ();	// ЭтоПользовательИБ,Язык,ЗапрещеноИзменятьПароль,ПоказыватьВСпискеВыбора,ПарольУстановлен,Роли
	Если ОписаниеПользователяИБ.ЭтоПользовательИБ Тогда
		ПользовательИБЗапрещеноИзменятьПароль	= ОписаниеПользователяИБ.ЗапрещеноИзменятьПароль;
		//ПользовательИБПарольУстановлен        = ОписаниеПользователяИБ.ПарольУстановлен; 
	    ПользовательИБПоказыватьВСпискеВыбора   = ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора;
		ПользовательИБЯзык                      = ОписаниеПользователяИБ.Язык; 
		Если НЕ РольДоступна("Администратор") Тогда
			Элементы.Код.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	Если Объект.ПарольУстановлен <> ОписаниеПользователяИБ.ПарольУстановлен Тогда
	  	Объект.ПарольУстановлен = ОписаниеПользователяИБ.ПарольУстановлен;
	КонецЕсли;
	
	ОтобразитьРеквизитыПользователяИБ();
	ОтобразитьРеквизитыПароля();
	
	// Заполнение списка выбора языка
	Для каждого МетаданныеЯзыка Из Метаданные.Языки Цикл
		Элементы.ПользовательИБЯзык.СписокВыбора.Добавить(МетаданныеЯзыка.Имя, МетаданныеЯзыка.Синоним);
	КонецЦикла;
	
	Элементы.Тэг.СписокВыбора.ЗагрузитьЗначения(КэшТэгов());
	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Объект.ПользовательИБ Тогда
		
		ОписаниеПользователяИБ = ОписаниеПользователяИБ();
		ТребуетсяЗапись = Ложь;
		Если ПользовательИБЯзык <> ОписаниеПользователяИБ.Язык Тогда
			ТребуетсяЗапись = Истина;
		КонецЕсли;
		Если ПользовательИБЗапрещеноИзменятьПароль <> ОписаниеПользователяИБ.ЗапрещеноИзменятьПароль Тогда
			ТребуетсяЗапись = Истина;
		КонецЕсли;
		Если ПользовательИБПоказыватьВСпискеВыбора <> ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора Тогда
			ТребуетсяЗапись = Истина;
		КонецЕсли;
		
		Для каждого Р Из РолиПользователя Цикл 
			Если Р.Пометка Тогда
				Если ОписаниеПользователяИБ.Роли.НайтиПоЗначению(Р.Значение) = Неопределено Тогда
					ТребуетсяЗапись = Истина;
				КонецЕсли;	
			Иначе
				Если ОписаниеПользователяИБ.Роли.НайтиПоЗначению(Р.Значение) <> Неопределено Тогда
					ТребуетсяЗапись = Истина;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		Если ПарольИзменен Тогда
			ТребуетсяЗапись = Истина;
		КонецЕсли;
		
		Если ТребуетсяЗапись Тогда
			ЗаписатьПользователяИБ();
		КонецЕсли;
		
	КонецЕсли;                 
	
КонецПроцедуры

#КонецОбласти   

&НаСервере
Процедура ЗаписатьПользователяИБ()
	
	лПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);
	лПользовательИБ.Язык					=  ?(ПользовательИБЯзык="", Неопределено, Метаданные.Языки[ПользовательИБЯзык]);
	лПользовательИБ.ЗапрещеноИзменятьПароль	= ПользовательИБЗапрещеноИзменятьПароль;
	лПользовательИБ.ПоказыватьВСпискеВыбора	= ПользовательИБПоказыватьВСпискеВыбора; 
	Если ПарольИзменен Тогда
		лПользовательИБ.Пароль              = ПользовательИБПароль;  
	КонецЕсли;
    лПользовательИБ.Роли.Очистить();
	Для каждого Р Из РолиПользователя Цикл
		Если Р.Пометка Тогда
		    лПользовательИБ.Роли.Добавить(Метаданные.Роли[Р.Значение]);
		КонецЕсли;
	КонецЦикла;
	лПользовательИБ.Записать();
	
КонецПроцедуры

&НаСервере
Функция ОписаниеПользователяИБ() 
	
	УстановитьПривилегированныйРежим(Истина);
	лПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);
	Если лПользовательИБ = Неопределено Тогда
		ОписаниеПользователяИБ = Новый Структура("ЭтоПользовательИБ,Язык,ЗапрещеноИзменятьПароль,ПоказыватьВСпискеВыбора,ПарольУстановлен,Роли",
												Ложь, "", Ложь, Ложь, Ложь, Новый СписокЗначений); 
	Иначе	
		лРоли = Новый СписокЗначений;
		Для каждого Р Из лПользовательИБ.Роли Цикл
			лРоли.Добавить(Р.Имя);
		КонецЦикла;
		ОписаниеПользователяИБ = Новый Структура("ЭтоПользовательИБ,Язык,ЗапрещеноИзменятьПароль,ПоказыватьВСпискеВыбора,ПарольУстановлен,Роли",
												Истина,
											 	?(лПользовательИБ.Язык=Неопределено, "", Строка(лПользовательИБ.Язык.Имя)),   
												лПользовательИБ.ЗапрещеноИзменятьПароль, 
												лПользовательИБ.ПоказыватьВСпискеВыбора,
												лПользовательИБ.ПарольУстановлен,
												лРоли);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ОписаниеПользователяИБ;
	
КонецФункции


&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	Код = СокрЛП(Код);
    // © Primus1C  03.03.2024  НАЧАЛО ►
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Код;	
	КонецЕсли;	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры


#Область ОбработчикиСобытийЭлементовАутентификации

&НаКлиенте
Процедура ВходВПрограммуРазрешенПриИзменении(Элемент)

Если Объект.ПометкаУдаления И Объект.ВходВПрограммуРазрешен Тогда
		Объект.ВходВПрограммуРазрешен = Ложь;
		ПоказатьПредупреждение(,
			НСтр("ru='Чтобы разрешить вход в программу, требуется снять"
"пометку на удаление с этого пользователя.';en='Чтобы разрешить вход в программу, требуется снять"
"пометку на удаление с этого пользователя.'"));
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыРоли

////////////////////////////////////////////////////////////////////////////////
// Для работы интерфейса ролей.

&НаКлиенте
Процедура РолиПользователяПередУдалением(Элемент, Отказ)
	отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РолиПользователяПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура СкопироватьТЧПользователяНаСервере(Польз, ИмяТЧ, ИмяРеквизита)
	
	ПользИсточник = Польз.ПолучитьОбъект();
	Для каждого СтрокаТЧ Из ПользИсточник[ИмяТЧ] Цикл 
		НайдСтроки = Объект[ИмяТЧ].НайтиСтроки(Новый Структура(ИмяРеквизита, СтрокаТЧ[ИмяРеквизита]));
		Если НайдСтроки.Количество() = 0 Тогда
			НовСтрока = Объект[ИмяТЧ].Добавить();
			//НовСтрока[ИмяРеквизита] = СтрокаТЧ[ИмяРеквизита];
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСкладыПользователя(Команда)  
	
	ВыбПольз = гоПустой("Пользователи");
	ПоказатьВводЗначения(Новый ОписаниеОповещения("СкопироватьСкладыПользователяПослеВыбора", ЭтотОбъект), ВыбПольз, "Выберите пользователя");
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСкладыПользователяПослеВыбора(ВыбПольз, ДопПараметры) Экспорт
	
	Если ВыбПольз = Неопределено Тогда Возврат КонецЕсли;
	
	СкопироватьТЧПользователяНаСервере(ВыбПольз, "Склады", "Склад");
	Модифицированность = Истина;
	
КонецПроцедуры



&НаКлиенте
Процедура СкопироватьСкладыКонтрагентов(Команда)

	ВыбПольз = гоПустой("Пользователи");
	ПоказатьВводЗначения(Новый ОписаниеОповещения("СкопироватьСкладыКонтрагентовПослеВыбора", ЭтотОбъект), ВыбПольз, "Выберите пользователя");

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСкладыКонтрагентовПослеВыбора(ВыбПольз, ДопПараметры) Экспорт
	Если ВыбПольз = Неопределено Тогда Возврат КонецЕсли;

	СкопироватьТЧПользователяНаСервере(ВыбПольз, "СкладыКонтрагентов", "Склад");
	Модифицированность = Истина;

КонецПроцедуры


&НаКлиенте
Процедура СкопироватьКонтрагентов(Команда)

	ВыбПольз = гоПустой("Пользователи");
	ПоказатьВводЗначения(Новый ОписаниеОповещения("СкопироватьКонтрагентовПослеВыбора", ЭтотОбъект), ВыбПольз, "Выберите пользователя");

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьКонтрагентовПослеВыбора(ВыбПольз, ДопПараметры) Экспорт
	Если ВыбПольз = Неопределено Тогда Возврат КонецЕсли;

	СкопироватьТЧПользователяНаСервере(ВыбПольз, "Контрагенты", "Группа");
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьДенежныеСчета(Команда)

	ВыбПольз = гоПустой("Пользователи");
	ПоказатьВводЗначения(Новый ОписаниеОповещения("СкопироватьДенежныеСчетаПослеВыбора", ЭтотОбъект), ВыбПольз, "Выберите пользователя");

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьДенежныеСчетаПослеВыбора(ВыбПольз, ДопПараметры) Экспорт
	Если ВыбПольз = Неопределено Тогда Возврат КонецЕсли;

	СкопироватьТЧПользователяНаСервере(ВыбПольз, "ДенежныеСчета", "ДенежныйСчет");
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьОграниченияПоСкладам(Команда)

	ВыбПольз = гоПустой("Пользователи");
	ПоказатьВводЗначения(Новый ОписаниеОповещения("СкопироватьОграниченияПоСкладамПослеВыбора", ЭтотОбъект), ВыбПольз, "Выберите пользователя");

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьОграниченияПоСкладамПослеВыбора(ВыбПольз, ДопПараметры) Экспорт
	Если ВыбПольз = Неопределено Тогда Возврат КонецЕсли;

	СкопироватьТЧПользователяНаСервере(ВыбПольз, "ОграниченияПоСкладам", "Склад");
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьРоли(Команда)

	ВыбПольз = гоПустой("Пользователи");
	ПоказатьВводЗначения(Новый ОписаниеОповещения("СкопироватьРолиПослеВыбора", ЭтотОбъект), ВыбПольз, "Выберите пользователя");

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьРолиПослеВыбора(ВыбПольз, ДопПараметры) Экспорт
	Если ВыбПольз = Неопределено Тогда Возврат КонецЕсли;

	СкопироватьРолиНаСервере(ВыбПольз);
	Модифицированность = Истина;

КонецПроцедуры


&НаСервере
Процедура СкопироватьРолиНаСервере(Польз)

	лПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Польз.ИдентификаторПользователяИБ);
	
	РолиПользователя.ЗаполнитьПометки(Ложь);
	Для каждого Роль Из лПользовательИБ.Роли Цикл  
		РолиПользователя.НайтиПоЗначению(Роль.Имя).Пометка = Истина;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура СменитьПароль(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВернутьПарольБезУстановки", Истина);
	ПараметрыФормы.Вставить("СтарыйПароль", ПользовательИБСтарыйПароль);
	ПараметрыФормы.Вставить("Пользователь", Объект.Ссылка);
	
	ОткрытьФорму("ОбщаяФорма.СменаПароля", ПараметрыФормы,,,,, Новый ОписаниеОповещения("СменитьПарольПослеПолученияПароля", ЭтотОбъект));
	
КонецПроцедуры

// Продолжение процедуры СменитьПароль.
&НаКлиенте
Процедура СменитьПарольПослеПолученияПароля(Результат, Контекст) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ПарольИзменен					= Истина;
	ПользовательИБПароль       		= Результат.НовыйПароль;
	ПользовательИБСтарыйПароль 		= Результат.СтарыйПароль;
	//ПользовательИБПарольУстановлен	= ЗначениеЗаполнено(Результат.НовыйПароль);
	Объект.ПарольУстановлен			= ЗначениеЗаполнено(Результат.НовыйПароль);
	
	//Если Результат.СтарыйПароль <> Неопределено Тогда
	//	ПарольПользователяСервиса = Результат.СтарыйПароль;
	//КонецЕсли;
	//УстановитьНеобходимостьСинхронизацииССервисом(ЭтотОбъект);
	//
	//УстановитьНаличиеПароля(ЭтотОбъект, ЗначениеЗаполнено(ПользовательИБПароль),
	//	ПользователиКлиент.АвторизованныйПользователь());
	//
	//УстановитьДоступностьСвойств(ЭтотОбъект);
	
    ОтобразитьРеквизитыПароля();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПользователяИБНаСервере(Отказ) 
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторПользователяИБ) Тогда
		Если ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ) = Неопределено Тогда
			НовПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
			НовПользователь.УникальныйИдентификатор = Объект.ИдентификаторПользователяИБ;
			НовПользователь.Имя = Объект.Код;
			НовПользователь.ПолноеИмя = Объект.Наименование;
			Попытка
				НовПользователь.Записать();
				Объект.ПользовательИБ = Истина;
				Сообщить("Создан новый пользователь ИБ");
			Исключение
				Отказ = Истина;
				Сообщить(ОписаниеОшибки()); 
			КонецПопытки;
		Иначе	
			Сообщить("Пользователь ИБ уже существует!");
		КонецЕсли;
	Иначе
		НовПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовПользователь.Имя = Объект.Код;
		НовПользователь.ПолноеИмя = Объект.Наименование;
		Попытка
			НовПользователь.Записать();
			Объект.ПользовательИБ = Истина;
			Объект.ИдентификаторПользователяИБ = НовПользователь.УникальныйИдентификатор;
			Сообщить("Создан новый пользователь ИБ");
		Исключение
			Отказ = Истина;
			Сообщить(ОписаниеОшибки()); 
		КонецПопытки;
	КонецЕсли;      
	
	// заполним реквизиты пользователя ИБ ?

КонецПроцедуры

&НаКлиенте
Процедура СоздатьПользователяИБ(Команда)    
	
	Если НЕ ЗначениеЗаполнено(Объект.Код) Тогда
		клВнимание(	"Заполните имя пользователя"
					"(закладка 'Основное', поле 'Вход 1С')", , "Аутентификация пользователя");
		Возврат;
	КонецЕсли;
	Отказ = Ложь;
	СоздатьПользователяИБНаСервере(Отказ);
	Если НЕ Отказ Тогда   
		ОтобразитьРеквизитыПользователяИБ();
		Модифицированность = Истина;
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьРеквизитыПользователяИБ()
	
	Элементы.ВходВПрограммуРазрешен.Видимость		= Объект.ПользовательИБ;		
	Элементы.СоздатьПользователяИБ.Видимость 		= НЕ Объект.ПользовательИБ;
	Элементы.ДекорацияНеПользовательИБ.Видимость 	= НЕ Объект.ПользовательИБ; 
	Элементы.ИдентификаторПользователяИБ.Видимость 	= Объект.ПользовательИБ;
	
	Элементы.ГрСвойстваАутентификации.Видимость     = Объект.ПользовательИБ;
	Элементы.РолиПользователя.Видимость				= Объект.ПользовательИБ; 
	
	Если Объект.ПользовательИБ Тогда  
		
		ОписаниеПользователяИБ = ОписаниеПользователяИБ();
		
		Если ОписаниеПользователяИБ.Язык <> Неопределено Тогда
			ПользовательИБЯзык 					= ОписаниеПользователяИБ.Язык;
		КонецЕсли;
		ПользовательИБЗапрещеноИзменятьПароль	= ОписаниеПользователяИБ.ЗапрещеноИзменятьПароль;
		ПользовательИБПоказыватьВСпискеВыбора	= ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора;
		Для каждого Роль Из Метаданные.Роли Цикл
			пометка = ОписаниеПользователяИБ.Роли.НайтиПоЗначению(Роль.Имя) <> Неопределено;
			РолиПользователя.Добавить(Роль.Имя, Роль.Представление(), пометка);
		КонецЦикла; 
		
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьРеквизитыПароля()
	
	//Если ПользовательИБПарольУстановлен Тогда
	Если Объект.ПарольУстановлен Тогда
		Элементы.НадписьНаличиеПароля.Заголовок 			= НСтр("ru='Пароль установлен';uk='Password set'");
		Элементы.ПотребоватьСменуПароляПриВходе.Заголовок 	= НСтр("ru='Потребовать смену пароля при входе';en='Require password change upon login'"); 
		Элементы.СменитьПароль.Заголовок 					= НСтр("ru='Сменить пароль...';en='Change password...'");
	Иначе
		Элементы.НадписьНаличиеПароля.Заголовок 			= НСтр("ru='Пустой пароль';en='Empty password'");
		Элементы.ПотребоватьСменуПароляПриВходе.Заголовок 	= НСтр("ru='Потребовать установку пароля при входе';en='Require password set upon login'"); 
		Элементы.СменитьПароль.Заголовок 					= НСтр("ru='Установить пароль...';en='Set password...'");
	КонецЕсли; 
	Элементы.ДекорацияПарольЕсть.Видимость = Объект.ПарольУстановлен;
	Элементы.ДекорацияПароляНет.Видимость  = НЕ Объект.ПарольУстановлен;
	
КонецПроцедуры

&НаСервере
Функция КэшТэгов() 
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	Пользователи.Тэг КАК Тэг
	             |ИЗ
	             |	Справочник.Пользователи КАК Пользователи
	             |ГДЕ
	             |	Пользователи.Тэг <> """"
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Тэг";
    Возврат Запр.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции

// © Primus1C  ОКОНЧАНИЕ ◄


#Область НастройкиСканераШК

&НаКлиенте
Процедура Версия(Команда)
	Сканер = РаботаСоСканеромШК.ПолучитьОбъектДрайвераСканераШтрихКодов();
	
	ВходныеПараметры = Неопределено;
	ПараметрыПодключения = Неопределено;
	ВыходныеПараметры = Новый Массив;
	
	ПодключаемоеОборудование1ССканерыШтрихкодаКлиент.ПолучитьВерсиюДрайвера(Сканер, ВходныеПараметры, ПараметрыПодключения, ВыходныеПараметры);
	
	Драйвер = ВыходныеПараметры[0];
	Версия = ВыходныеПараметры[1];
	
	клВнимание("Драйвер = " + Драйвер + гоРС() + "Версия = " + Версия);
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	Сканер = РаботаСоСканеромШК.ПолучитьОбъектДрайвераСканераШтрихКодов();
	
	времПараметрыУстройства = Новый Структура();
	времПараметрыУстройства.Вставить("Порт", Объект.Порт);
	времПараметрыУстройства.Вставить("Скорость", Объект.Скорость);
	времПараметрыУстройства.Вставить("БитДанных", Объект.БитДанных);
	времПараметрыУстройства.Вставить("СтопБит", 0);
	времПараметрыУстройства.Вставить("Префикс", "");
	времПараметрыУстройства.Вставить("Суффикс", "");
	времПараметрыУстройства.Вставить("Таймаут", 75);
	времПараметрыУстройства.Вставить("Модель", "");
	
	ПараметрыПодключения = Неопределено;
	ВыходныеПараметры = Новый Массив;
	
	ПодключаемоеОборудование1ССканерыШтрихкодаКлиент.ТестУстройства(Сканер, времПараметрыУстройства, ПараметрыПодключения, ВыходныеПараметры);
КонецПроцедуры

&НаКлиенте
Процедура Настройка(Команда)
	ОткрытьФорму("ОбщаяФорма.НастройкаСканераШтрихКодов");
КонецПроцедуры
	
#КонецОбласти


&НаКлиенте
Процедура СкладыПередУдалением(Элемент, Отказ)
	//Отказ = клНетДа(НСтр("ru = 'Удалить строку?'; en = 'Delete line?'"));  
	Отказ = Истина;
	
	Стр = Элементы.Склады.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("СкладыПередУдалениемЗавершение", ЭтотОбъект, Стр),
		НСтр("ru = 'Удалить строку?'; en = 'Delete line?'"));

КонецПроцедуры

&НаКлиенте
Процедура СкладыПередУдалениемЗавершение(Результат, Стр) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	Объект.Склады.Удалить(Стр);
КонецПроцедуры

&НаКлиенте
Процедура ДенежныеСчетаПередУдалением(Элемент, Отказ)
	//Отказ = клНетДа(НСтр("ru = 'Удалить строку?'; en = 'Delete line?'")); 
	Отказ = Истина;
	
	Стр = Элементы.ДенежныеСчета.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("ДенежныеСчетаПередУдалениемЗавершение", ЭтотОбъект, Стр),
		НСтр("ru = 'Удалить строку?'; en = 'Delete line?'"));

КонецПроцедуры

&НаКлиенте
Процедура ДенежныеСчетаПередУдалениемЗавершение(Результат, Стр) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	Объект.ДенежныеСчета.Удалить(Стр);
КонецПроцедуры

&НаКлиенте
Процедура ОграниченияПоСкладамПередУдалением(Элемент, Отказ)
	//Отказ = клНетДа(НСтр("ru = 'Удалить строку?'; en = 'Delete line?'")); 
		Отказ = Истина;
	
	Стр = Элементы.ОграниченияПоСкладам.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("ОграниченияПоСкладамПередУдалениемЗавершение", ЭтотОбъект, Стр),
		НСтр("ru = 'Удалить строку?'; en = 'Delete line?'"));

КонецПроцедуры

&НаКлиенте
Процедура ОграниченияПоСкладамПередУдалениемЗавершение(Результат, Стр) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	Объект.ОграниченияПоСкладам.Удалить(Стр);
КонецПроцедуры
